<details ><summary>Digger run report at 2025-09-30 21:11:05 (UTC)</summary>
      <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # module.s3_bucket.aws_s3_bucket.main will be created
  + resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "test"
          + "ManagedBy"   = "digger"
          + "Name"        = "Digger Test Bucket"
          + "Project"     = "white-oak"
        }
      + tags_all                    = {
          + "Environment" = "test"
          + "ManagedBy"   = "digger"
          + "Name"        = "Digger Test Bucket"
          + "Project"     = "white-oak"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.main will be created
  + resource "aws_s3_bucket_public_access_block" "main" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_bucket.aws_s3_bucket_server_side_encryption_configuration.main will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.s3_bucket.aws_s3_bucket_versioning.main will be created
  + resource "aws_s3_bucket_versioning" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.s3_bucket.random_id.bucket_suffix will be created
  + resource "random_id" "bucket_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_arn         = (known after apply)
  + bucket_domain_name = (known after apply)
  + bucket_name        = (known after apply)

─────────────────────────────────────────────────────────────────────────────
```
</details>

<details ><summary>Terraform plan validation check (production)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |                                  RESOURCE                                  |
|--------|----------------------------------------------------------------------------|
| add    | `module.s3_bucket.aws_s3_bucket.main`                                      |
|        | `module.s3_bucket.aws_s3_bucket_public_access_block.main`                  |
|        | `module.s3_bucket.aws_s3_bucket_server_side_encryption_configuration.main` |
|        | `module.s3_bucket.aws_s3_bucket_versioning.main`                           |
|        | `module.s3_bucket.random_id.bucket_suffix`                                 |

| CHANGE |        OUTPUT        |
|--------|----------------------|
| add    | `bucket_arn`         |
|        | `bucket_domain_name` |
|        | `bucket_name`        |

</details>

</details>